In [ ]:
#Primary Key - Not null + unique
#Not NULL -
#Unique
#Syntax for foreign jey - student_id REFERENCES
 #                        student(student_id)
#INNER JOIN → A ∩ B | LEFT JOIN → A ∪ (A ∩ B) → A + A^B | RIGHT JOIN → B ∪ (A ∩ B) → B + A^B | FULL JOIN → A ∪ B
Microsoft Windows [Version 10.0.26200.7623]
(c) Microsoft Corporation. All rights reserved.

C:\Users\muska>mysql -u root -p
Enter password: **********
Welcome to the MySQL monitor.  Commands end with ; or \g.
Your MySQL connection id is 16
Server version: 8.0.44 MySQL Community Server - GPL

Copyright (c) 2000, 2025, Oracle and/or its affiliates.

Oracle is a registered trademark of Oracle Corporation and/or its
affiliates. Other names may be trademarks of their respective
owners.

Type 'help;' or '\h' for help. Type '\c' to clear the current input statement.

mysql> USE school;
Database changed
mysql> CREATE TABLE xyz(
    ->  id INT PRIMARY KEY,
    ->     name VARCHAR(20) NOT NULL,
    ->     phone_no BIGINT UNIQUE
    -> );
Query OK, 0 rows affected (0.21 sec)

mysql> ALTER TABLE xyz
    -> ADD marks INT CHECK (marks > 0 AND marks < 100);
Query OK, 0 rows affected (0.18 sec)
Records: 0  Duplicates: 0  Warnings: 0

mysql> SHOW DATABASES;
+--------------------+
| Database           |
+--------------------+
| information_schema |
| mysql              |
| performance_schema |
| school             |
| student            |
| sys                |
+--------------------+
6 rows in set (0.10 sec)

mysql> ALTER TABLE xyz
    -> ADD course VARCHAR(200) DEFAULT 'PYTHON';
Query OK, 0 rows affected (0.12 sec)
Records: 0  Duplicates: 0  Warnings: 0

mysql> CREATE TABLE table1 (
    ->     student_id INT PRIMARY KEY,
    ->     name VARCHAR(50),
    ->     age INT
    -> );
Query OK, 0 rows affected (0.28 sec)

mysql>
mysql> CREATE TABLE table2 (
    ->     student_id INT,
    ->     course VARCHAR(50),
    ->     duration INT,
    ->     FOREIGN KEY (student_id) REFERENCES table1(student_id)
    -> );
Query OK, 0 rows affected (0.07 sec)

mysql> DROP TABLE IF EXISTS table2;
Query OK, 0 rows affected (0.15 sec)

mysql> DROP TABLE IF EXISTS table1;
Query OK, 0 rows affected (0.02 sec)
mysql> CREATE TABLE table1 (
    ->     student_id INT PRIMARY KEY,
    ->     name VARCHAR(50),
    ->     age INT
    -> );
Query OK, 0 rows affected (0.04 sec)

mysql> CREATE TABLE table2 (
    ->     mark_id INT PRIMARY KEY,
    ->     student_id INT,       -- this links to table1
    ->     subject VARCHAR(50),
    ->     marks INT,
    ->     FOREIGN KEY (student_id) REFERENCES table1(student_id)
    -> );
Query OK, 0 rows affected (0.04 sec)

mysql> DROP TABLE table2;
Query OK, 0 rows affected (0.12 sec)

mysql> DROP TABLE table1;
Query OK, 0 rows affected (0.03 sec)

mysql> CREATE TABLE employee (
    ->     employee_id INT PRIMARY KEY,
    ->     employee_name VARCHAR(50) UNIQUE,
    ->     employee_city VARCHAR(50) NOT NULL
    -> );
Query OK, 0 rows affected (0.10 sec)

mysql> CREATE TABLE department (
    ->     department_id INT PRIMARY KEY,
    ->     emp_id INT,
    ->     department VARCHAR(50) NOT NULL,
    ->     salary DECIMAL(10,2) CHECK (salary > 0),
    ->     FOREIGN KEY (emp_id) REFERENCES employee(employee_id)
    -> );
Query OK, 0 rows affected (0.05 sec)

mysql> SHOW TABLES;
+------------------+
| Tables_in_school |
+------------------+
| candidates       |
| department       |
| employee         |
| employees        |
| student          |
| students         |
| xyz              |
+------------------+
7 rows in set (0.15 sec)

mysql> SELECT e.employee_name, d.salary
    -> FROM employee AS e
    -> JOIN department AS d ON e.employee_id = d.emp_id;
Empty set (0.03 sec)

mysql> CREATE TABLE customers (
    ->     customer_id INT PRIMARY KEY,
    ->     customer_name VARCHAR(50),
    ->     city VARCHAR(50)
    -> );
Query OK, 0 rows affected (0.30 sec)

mysql> CREATE TABLE orders (
    ->     order_id INT PRIMARY KEY,
    ->     customer_id INT,
    ->     product VARCHAR(50),
    ->     amount INT
    -> );
Query OK, 0 rows affected (0.06 sec)

mysql> INSERT INTO customers VALUES
    -> (1, 'Aman', 'Delhi'),
    -> (2, 'Riya', 'Mumbai'),
    -> (3, 'Kabir', 'Delhi'),
    -> (4, 'Neha', 'Pune'),
    -> (5, 'Arjun', 'Bangalore'),
    -> (6, 'Simran', 'Mumbai'),
    -> (7, 'Rahul', 'Delhi'),
    -> (8, 'Pooja', 'Chennai'),
    -> (9, 'Vikas', 'Pune'),
    -> (10, 'Anita', 'Bangalore');
Query OK, 10 rows affected (0.08 sec)
Records: 10  Duplicates: 0  Warnings: 0

mysql> INSERT INTO orders VALUES
    -> (101, 1, 'Laptop', 60000),
    -> (102, 1, 'Mouse', 1500),
    -> (103, 2, 'Mobile', 30000),
    -> (104, 3, 'Keyboard', 2500),
    -> (105, 3, 'Monitor', 12000),
    -> (106, 5, 'Tablet', 20000),
    -> (107, 6, 'Laptop', 65000),
    -> (108, 7, 'Mobile', 28000),
    -> (109, 7, 'Earphones', 2000),
    -> (110, 11, 'Camera', 40000);
Query OK, 10 rows affected (0.03 sec)
Records: 10  Duplicates: 0  Warnings: 0

mysql> SELECT
    ->     c.customer_name,
    ->     o.product,
    ->     o.amount
    -> FROM customers c
    -> JOIN orders o
    -> ON c.customer_id = o.customer_id;
+---------------+-----------+--------+
| customer_name | product   | amount |
+---------------+-----------+--------+
| Aman          | Laptop    |  60000 |
| Aman          | Mouse     |   1500 |
| Riya          | Mobile    |  30000 |
| Kabir         | Keyboard  |   2500 |
| Kabir         | Monitor   |  12000 |
| Arjun         | Tablet    |  20000 |
| Simran        | Laptop    |  65000 |
| Rahul         | Mobile    |  28000 |
| Rahul         | Earphones |   2000 |
+---------------+-----------+--------+
9 rows in set (0.07 sec)

mysql> SELECT DISTINCT
    ->     c.customer_name,
    ->     c.city,
    ->     o.product,
    ->     o.amount
    -> FROM customers c
    -> JOIN orders o
    -> ON c.customer_id = o.customer_id
    -> WHERE c.city = 'Delhi';
+---------------+-------+-----------+--------+
| customer_name | city  | product   | amount |
+---------------+-------+-----------+--------+
| Aman          | Delhi | Laptop    |  60000 |
| Aman          | Delhi | Mouse     |   1500 |
| Kabir         | Delhi | Keyboard  |   2500 |
| Kabir         | Delhi | Monitor   |  12000 |
| Rahul         | Delhi | Mobile    |  28000 |
| Rahul         | Delhi | Earphones |   2000 |
+---------------+-------+-----------+--------+
6 rows in set (0.03 sec)

mysql> SELECT
    ->     c.customer_id,
    ->     c.customer_name,
    ->     c.city,
    ->     o.product,
    ->     o.amount
    -> FROM customers c
    -> LEFT JOIN orders o
    -> ON c.customer_id = o.customer_id;
+-------------+---------------+-----------+-----------+--------+
| customer_id | customer_name | city      | product   | amount |
+-------------+---------------+-----------+-----------+--------+
|           1 | Aman          | Delhi     | Mouse     |   1500 |
|           1 | Aman          | Delhi     | Laptop    |  60000 |
|           2 | Riya          | Mumbai    | Mobile    |  30000 |
|           3 | Kabir         | Delhi     | Monitor   |  12000 |
|           3 | Kabir         | Delhi     | Keyboard  |   2500 |
|           4 | Neha          | Pune      | NULL      |   NULL |
|           5 | Arjun         | Bangalore | Tablet    |  20000 |
|           6 | Simran        | Mumbai    | Laptop    |  65000 |
|           7 | Rahul         | Delhi     | Earphones |   2000 |
|           7 | Rahul         | Delhi     | Mobile    |  28000 |
|           8 | Pooja         | Chennai   | NULL      |   NULL |
|           9 | Vikas         | Pune      | NULL      |   NULL |
|          10 | Anita         | Bangalore | NULL      |   NULL |
+-------------+---------------+-----------+-----------+--------+
13 rows in set (0.03 sec)

mysql> SELECT c.customer_name, o.product
    ->     FROM customers c
    ->     LEFT JOIN orders o
    ->     ON c.customer_id = o.customer_id;
+---------------+-----------+
| customer_name | product   |
+---------------+-----------+
| Aman          | Mouse     |
| Aman          | Laptop    |
| Riya          | Mobile    |
| Kabir         | Monitor   |
| Kabir         | Keyboard  |
| Neha          | NULL      |
| Arjun         | Tablet    |
| Simran        | Laptop    |
| Rahul         | Earphones |
| Rahul         | Mobile    |
| Pooja         | NULL      |
| Vikas         | NULL      |
| Anita         | NULL      |
+---------------+-----------+
13 rows in set (0.02 sec)

mysql> SELECT
    ->     o.order_id,
    ->     o.product,
    ->     o.amount,
    ->     c.customer_name,
    ->     c.city
    -> FROM customers c
    -> RIGHT JOIN orders o
    -> ON c.customer_id = o.customer_id;
+----------+-----------+--------+---------------+-----------+
| order_id | product   | amount | customer_name | city      |
+----------+-----------+--------+---------------+-----------+
|      101 | Laptop    |  60000 | Aman          | Delhi     |
|      102 | Mouse     |   1500 | Aman          | Delhi     |
|      103 | Mobile    |  30000 | Riya          | Mumbai    |
|      104 | Keyboard  |   2500 | Kabir         | Delhi     |
|      105 | Monitor   |  12000 | Kabir         | Delhi     |
|      106 | Tablet    |  20000 | Arjun         | Bangalore |
|      107 | Laptop    |  65000 | Simran        | Mumbai    |
|      108 | Mobile    |  28000 | Rahul         | Delhi     |
|      109 | Earphones |   2000 | Rahul         | Delhi     |
|      110 | Camera    |  40000 | NULL          | NULL      |
+----------+-----------+--------+---------------+-----------+
10 rows in set (0.02 sec)

mysql> SELECT
    ->     o.order_id,
    ->     o.customer_id,
    ->     o.product,
    ->     o.amount
    -> FROM orders o
    -> LEFT JOIN customers c
    -> ON o.customer_id = c.customer_id
    -> WHERE c.customer_id IS NULL;
+----------+-------------+---------+--------+
| order_id | customer_id | product | amount |
+----------+-------------+---------+--------+
|      110 |          11 | Camera  |  40000 |
+----------+-------------+---------+--------+
1 row in set (0.01 sec)

mysql> SELECT
    ->     c.customer_id,
    ->     c.customer_name,
    ->     c.city,
    ->     o.order_id,
    ->     o.product,
    ->     o.amount
    -> FROM customers c
    -> LEFT JOIN orders o
    -> ON c.customer_id = o.customer_id
    ->
    -> UNION
    ->
    -> SELECT
    ->     c.customer_id,
    ->     c.customer_name,
    ->     c.city,
    ->     o.order_id,
    ->     o.product,
    ->     o.amount
    -> FROM customers c
    -> RIGHT JOIN orders o
    -> ON c.customer_id = o.customer_id;
+-------------+---------------+-----------+----------+-----------+--------+
| customer_id | customer_name | city      | order_id | product   | amount |
+-------------+---------------+-----------+----------+-----------+--------+
|           1 | Aman          | Delhi     |      102 | Mouse     |   1500 |
|           1 | Aman          | Delhi     |      101 | Laptop    |  60000 |
|           2 | Riya          | Mumbai    |      103 | Mobile    |  30000 |
|           3 | Kabir         | Delhi     |      105 | Monitor   |  12000 |
|           3 | Kabir         | Delhi     |      104 | Keyboard  |   2500 |
|           4 | Neha          | Pune      |     NULL | NULL      |   NULL |
|           5 | Arjun         | Bangalore |      106 | Tablet    |  20000 |
|           6 | Simran        | Mumbai    |      107 | Laptop    |  65000 |
|           7 | Rahul         | Delhi     |      109 | Earphones |   2000 |
|           7 | Rahul         | Delhi     |      108 | Mobile    |  28000 |
|           8 | Pooja         | Chennai   |     NULL | NULL      |   NULL |
|           9 | Vikas         | Pune      |     NULL | NULL      |   NULL |
|          10 | Anita         | Bangalore |     NULL | NULL      |   NULL |
|        NULL | NULL          | NULL      |      110 | Camera    |  40000 |
+-------------+---------------+-----------+----------+-----------+--------+
14 rows in set (0.07 sec)